/* automatically generated by rust-bindgen */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[allow(unused_imports)]
    use self::super::root;
    pub const VK_LBUTTON: u32 = 1;
    pub const VK_RBUTTON: u32 = 2;
    pub const VK_MBUTTON: u32 = 4;
    pub const VK_BACK: u32 = 8;
    pub const VK_TAB: u32 = 9;
    pub const VK_CLEAR: u32 = 12;
    pub const VK_RETURN: u32 = 13;
    pub const VK_SHIFT: u32 = 16;
    pub const VK_CONTROL: u32 = 17;
    pub const VK_MENU: u32 = 18;
    pub const VK_PAUSE: u32 = 19;
    pub const VK_CAPITAL: u32 = 20;
    pub const VK_ESCAPE: u32 = 27;
    pub const VK_SPACE: u32 = 32;
    pub const VK_PRIOR: u32 = 33;
    pub const VK_NEXT: u32 = 34;
    pub const VK_END: u32 = 35;
    pub const VK_HOME: u32 = 36;
    pub const VK_LEFT: u32 = 37;
    pub const VK_UP: u32 = 38;
    pub const VK_RIGHT: u32 = 39;
    pub const VK_DOWN: u32 = 40;
    pub const VK_SELECT: u32 = 41;
    pub const VK_PRINT: u32 = 42;
    pub const VK_SNAPSHOT: u32 = 44;
    pub const VK_INSERT: u32 = 45;
    pub const VK_DELETE: u32 = 46;
    pub const VK_HELP: u32 = 47;
    pub const VK_LWIN: u32 = 91;
    pub const VK_NUMPAD0: u32 = 96;
    pub const VK_NUMPAD1: u32 = 97;
    pub const VK_NUMPAD2: u32 = 98;
    pub const VK_NUMPAD3: u32 = 99;
    pub const VK_NUMPAD4: u32 = 100;

    pub const VK_MULTIPLY: u32 = 106;
    pub const VK_ADD: u32 = 107;
    pub const VK_SEPARATOR: u32 = 108;
    pub const VK_SUBTRACT: u32 = 109;
    pub const VK_DECIMAL: u32 = 110;
    pub const VK_DIVIDE: u32 = 111;
    pub const VK_F1: u32 = 112;
    pub const VK_F2: u32 = 113;
    pub const VK_F3: u32 = 114;
    pub const VK_F4: u32 = 115;
    pub const VK_F5: u32 = 116;
    pub const VK_F6: u32 = 117;
    pub const VK_F7: u32 = 118;
    pub const VK_F8: u32 = 119;
    pub const VK_F9: u32 = 120;
    pub const VK_F10: u32 = 121;
    pub const VK_F11: u32 = 122;
    pub const VK_F12: u32 = 123;
    pub const VK_F13: u32 = 124;
    pub const VK_F14: u32 = 125;
    pub const VK_F15: u32 = 126;
    pub const VK_F16: u32 = 127;
    pub const VK_F17: u32 = 128;
    pub const VK_F18: u32 = 129;
    pub const VK_F19: u32 = 130;
    pub const VK_F20: u32 = 131;
    pub const VK_F21: u32 = 132;
    pub const VK_F22: u32 = 133;
    pub const VK_F23: u32 = 134;
    pub const VK_F24: u32 = 135;
    pub const VK_NUMLOCK: u32 = 144;
    pub const VK_SCROLL: u32 = 145;
    pub const REAPER_PLUGIN_VERSION: u32 = 526;
    pub const CSURF_EXT_RESET: u32 = 131071;
    pub const CSURF_EXT_SETINPUTMONITOR: u32 = 65537;
    pub const CSURF_EXT_SETMETRONOME: u32 = 65538;
    pub const CSURF_EXT_SETAUTORECARM: u32 = 65539;
    pub const CSURF_EXT_SETRECMODE: u32 = 65540;
    pub const CSURF_EXT_SETSENDVOLUME: u32 = 65541;
    pub const CSURF_EXT_SETSENDPAN: u32 = 65542;
    pub const CSURF_EXT_SETFXENABLED: u32 = 65543;
    pub const CSURF_EXT_SETFXPARAM: u32 = 65544;
    pub const CSURF_EXT_SETLASTTOUCHEDFX: u32 = 65546;
    pub const CSURF_EXT_SETFOCUSEDFX: u32 = 65547;
    pub const CSURF_EXT_SETLASTTOUCHEDTRACK: u32 = 65548;
    pub const CSURF_EXT_SETMIXERSCROLL: u32 = 65549;
    pub const CSURF_EXT_SETBPMANDPLAYRATE: u32 = 65545;
    pub const CSURF_EXT_SETPAN_EX: u32 = 65550;
    pub const CSURF_EXT_SETRECVVOLUME: u32 = 65552;
    pub const CSURF_EXT_SETRECVPAN: u32 = 65553;
    pub const CSURF_EXT_SETFXOPEN: u32 = 65554;
    pub const CSURF_EXT_SETFXCHANGE: u32 = 65555;
    pub const CSURF_EXT_SETPROJECTMARKERCHANGE: u32 = 65556;
    pub const CSURF_EXT_SETFXPARAM_RECFX: u32 = 65560;
    pub const CSURF_EXT_SUPPORTS_EXTENDED_TOUCH: u32 = 524289;
    pub const UNDO_STATE_ALL: u32 = 4294967295;
    pub const UNDO_STATE_TRACKCFG: u32 = 1;
    pub const UNDO_STATE_FX: u32 = 2;
    pub const UNDO_STATE_ITEMS: u32 = 4;
    pub const UNDO_STATE_MISCCFG: u32 = 8;
    pub const UNDO_STATE_FREEZE: u32 = 16;
    pub type ReaSample = f64;
    pub type __intptr_t = ::std::os::raw::c_long;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct __pthread_internal_list {
        pub __prev: *mut root::__pthread_internal_list,
        pub __next: *mut root::__pthread_internal_list,
    }
    #[test]
    fn bindgen_test_layout___pthread_internal_list() {
        assert_eq!(
            ::std::mem::size_of::<__pthread_internal_list>(),
            16usize,
            concat!("Size of: ", stringify!(__pthread_internal_list))
        );
        assert_eq!(
            ::std::mem::align_of::<__pthread_internal_list>(),
            8usize,
            concat!("Alignment of ", stringify!(__pthread_internal_list))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_list),
                "::",
                stringify!(__prev)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_list),
                "::",
                stringify!(__next)
            )
        );
    }
    pub type __pthread_list_t = root::__pthread_internal_list;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct __pthread_mutex_s {
        pub __lock: ::std::os::raw::c_int,
        pub __count: ::std::os::raw::c_uint,
        pub __owner: ::std::os::raw::c_int,
        pub __nusers: ::std::os::raw::c_uint,
        pub __kind: ::std::os::raw::c_int,
        pub __spins: ::std::os::raw::c_short,
        pub __elision: ::std::os::raw::c_short,
        pub __list: root::__pthread_list_t,
    }
    #[test]
    fn bindgen_test_layout___pthread_mutex_s() {
        assert_eq!(
            ::std::mem::size_of::<__pthread_mutex_s>(),
            40usize,
            concat!("Size of: ", stringify!(__pthread_mutex_s))
        );
        assert_eq!(
            ::std::mem::align_of::<__pthread_mutex_s>(),
            8usize,
            concat!("Alignment of ", stringify!(__pthread_mutex_s))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__lock)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__count)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__owner)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__nusers)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__kind)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__spins)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__elision)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__list)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union pthread_mutex_t {
        pub __data: root::__pthread_mutex_s,
        pub __size: [::std::os::raw::c_char; 40usize],
        pub __align: ::std::os::raw::c_long,
        _bindgen_union_align: [u64; 5usize],
    }
    #[test]
    fn bindgen_test_layout_pthread_mutex_t() {
        assert_eq!(
            ::std::mem::size_of::<pthread_mutex_t>(),
            40usize,
            concat!("Size of: ", stringify!(pthread_mutex_t))
        );
        assert_eq!(
            ::std::mem::align_of::<pthread_mutex_t>(),
            8usize,
            concat!("Alignment of ", stringify!(pthread_mutex_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__data)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__size)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__align)
            )
        );
    }
    pub mod std {
        #[allow(unused_imports)]
        use self::super::super::root;
    }
    pub mod __gnu_cxx {
        #[allow(unused_imports)]
        use self::super::super::root;
    }
    pub type INT_PTR = isize;
    pub type LONG_PTR = isize;
    pub type ULONG_PTR = usize;
    pub type DWORD = ::std::os::raw::c_uint;
    pub type UINT = ::std::os::raw::c_uint;
    pub type WPARAM = root::ULONG_PTR;
    pub type LPARAM = root::LONG_PTR;
    pub type LRESULT = root::LONG_PTR;
    pub type LONG = ::std::os::raw::c_int;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct HWND__ {
        _unused: [u8; 0],
    }
    pub type HWND = *mut root::HWND__;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct HMENU__ {
        _unused: [u8; 0],
    }
    pub type HMENU = *mut root::HMENU__;
    pub type HINSTANCE = *mut ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct POINT {
        pub x: root::LONG,
        pub y: root::LONG,
    }
    #[test]
    fn bindgen_test_layout_POINT() {
        assert_eq!(
            ::std::mem::size_of::<POINT>(),
            8usize,
            concat!("Size of: ", stringify!(POINT))
        );
        assert_eq!(
            ::std::mem::align_of::<POINT>(),
            4usize,
            concat!("Alignment of ", stringify!(POINT))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<POINT>())).x as *const _ as usize },
            0usize,
            concat!("Offset of field: ", stringify!(POINT), "::", stringify!(x))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<POINT>())).y as *const _ as usize },
            4usize,
            concat!("Offset of field: ", stringify!(POINT), "::", stringify!(y))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct RECT {
        pub left: root::LONG,
        pub top: root::LONG,
        pub right: root::LONG,
        pub bottom: root::LONG,
    }
    #[test]
    fn bindgen_test_layout_RECT() {
        assert_eq!(
            ::std::mem::size_of::<RECT>(),
            16usize,
            concat!("Size of: ", stringify!(RECT))
        );
        assert_eq!(
            ::std::mem::align_of::<RECT>(),
            4usize,
            concat!("Alignment of ", stringify!(RECT))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RECT>())).left as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(RECT),
                "::",
                stringify!(left)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RECT>())).top as *const _ as usize },
            4usize,
            concat!("Offset of field: ", stringify!(RECT), "::", stringify!(top))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RECT>())).right as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(RECT),
                "::",
                stringify!(right)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<RECT>())).bottom as *const _ as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(RECT),
                "::",
                stringify!(bottom)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct ACCEL {
        pub fVirt: ::std::os::raw::c_uchar,
        pub key: ::std::os::raw::c_ushort,
        pub cmd: ::std::os::raw::c_ushort,
    }
    #[test]
    fn bindgen_test_layout_ACCEL() {
        assert_eq!(
            ::std::mem::size_of::<ACCEL>(),
            6usize,
            concat!("Size of: ", stringify!(ACCEL))
        );
        assert_eq!(
            ::std::mem::align_of::<ACCEL>(),
            2usize,
            concat!("Alignment of ", stringify!(ACCEL))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ACCEL>())).fVirt as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ACCEL),
                "::",
                stringify!(fVirt)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ACCEL>())).key as *const _ as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(ACCEL),
                "::",
                stringify!(key)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ACCEL>())).cmd as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ACCEL),
                "::",
                stringify!(cmd)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct _GUID {
        pub Data1: ::std::os::raw::c_uint,
        pub Data2: ::std::os::raw::c_ushort,
        pub Data3: ::std::os::raw::c_ushort,
        pub Data4: [::std::os::raw::c_uchar; 8usize],
    }
    #[test]
    fn bindgen_test_layout__GUID() {
        assert_eq!(
            ::std::mem::size_of::<_GUID>(),
            16usize,
            concat!("Size of: ", stringify!(_GUID))
        );
        assert_eq!(
            ::std::mem::align_of::<_GUID>(),
            4usize,
            concat!("Alignment of ", stringify!(_GUID))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_GUID>())).Data1 as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_GUID),
                "::",
                stringify!(Data1)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_GUID>())).Data2 as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_GUID),
                "::",
                stringify!(Data2)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_GUID>())).Data3 as *const _ as usize },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(_GUID),
                "::",
                stringify!(Data3)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_GUID>())).Data4 as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_GUID),
                "::",
                stringify!(Data4)
            )
        );
    }
    pub type GUID = root::_GUID;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct MSG {
        pub hwnd: root::HWND,
        pub message: root::UINT,
        pub wParam: root::WPARAM,
        pub lParam: root::LPARAM,
        pub time: root::DWORD,
        pub pt: root::POINT,
    }
    #[test]
    fn bindgen_test_layout_MSG() {
        assert_eq!(
            ::std::mem::size_of::<MSG>(),
            48usize,
            concat!("Size of: ", stringify!(MSG))
        );
        assert_eq!(
            ::std::mem::align_of::<MSG>(),
            8usize,
            concat!("Alignment of ", stringify!(MSG))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MSG>())).hwnd as *const _ as usize },
            0usize,
            concat!("Offset of field: ", stringify!(MSG), "::", stringify!(hwnd))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MSG>())).message as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MSG),
                "::",
                stringify!(message)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MSG>())).wParam as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MSG),
                "::",
                stringify!(wParam)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MSG>())).lParam as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(MSG),
                "::",
                stringify!(lParam)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MSG>())).time as *const _ as usize },
            32usize,
            concat!("Offset of field: ", stringify!(MSG), "::", stringify!(time))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MSG>())).pt as *const _ as usize },
            36usize,
            concat!("Offset of field: ", stringify!(MSG), "::", stringify!(pt))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct HDC__ {
        _unused: [u8; 0],
    }
    pub type HDC = *mut root::HDC__;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct HGDIOBJ__ {
        _unused: [u8; 0],
    }
    pub type HFONT = *mut root::HGDIOBJ__;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct reaper_plugin_info_t {
        pub caller_version: ::std::os::raw::c_int,
        pub hwnd_main: root::HWND,
        pub Register: ::std::option::Option<
            unsafe extern "C" fn(
                name: *const ::std::os::raw::c_char,
                infostruct: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        pub GetFunc: ::std::option::Option<
            unsafe extern "C" fn(
                name: *const ::std::os::raw::c_char,
            ) -> *mut ::std::os::raw::c_void,
        >,
    }
    #[test]
    fn bindgen_test_layout_reaper_plugin_info_t() {
        assert_eq!(
            ::std::mem::size_of::<reaper_plugin_info_t>(),
            32usize,
            concat!("Size of: ", stringify!(reaper_plugin_info_t))
        );
        assert_eq!(
            ::std::mem::align_of::<reaper_plugin_info_t>(),
            8usize,
            concat!("Alignment of ", stringify!(reaper_plugin_info_t))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<reaper_plugin_info_t>())).caller_version as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(reaper_plugin_info_t),
                "::",
                stringify!(caller_version)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<reaper_plugin_info_t>())).hwnd_main as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(reaper_plugin_info_t),
                "::",
                stringify!(hwnd_main)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<reaper_plugin_info_t>())).Register as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(reaper_plugin_info_t),
                "::",
                stringify!(Register)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<reaper_plugin_info_t>())).GetFunc as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(reaper_plugin_info_t),
                "::",
                stringify!(GetFunc)
            )
        );
    }
    #[repr(C)]
    pub struct ProjectStateContext__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct ProjectStateContext {
        pub vtable_: *const ProjectStateContext__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_ProjectStateContext() {
        assert_eq!(
            ::std::mem::size_of::<ProjectStateContext>(),
            8usize,
            concat!("Size of: ", stringify!(ProjectStateContext))
        );
        assert_eq!(
            ::std::mem::align_of::<ProjectStateContext>(),
            8usize,
            concat!("Alignment of ", stringify!(ProjectStateContext))
        );
    }
    #[doc = " MIDI event definition and abstract list"]
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct MIDI_event_t {
        pub frame_offset: ::std::os::raw::c_int,
        pub size: ::std::os::raw::c_int,
        pub midi_message: [::std::os::raw::c_uchar; 4usize],
    }
    #[test]
    fn bindgen_test_layout_MIDI_event_t() {
        assert_eq!(
            ::std::mem::size_of::<MIDI_event_t>(),
            12usize,
            concat!("Size of: ", stringify!(MIDI_event_t))
        );
        assert_eq!(
            ::std::mem::align_of::<MIDI_event_t>(),
            4usize,
            concat!("Alignment of ", stringify!(MIDI_event_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MIDI_event_t>())).frame_offset as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MIDI_event_t),
                "::",
                stringify!(frame_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MIDI_event_t>())).size as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MIDI_event_t),
                "::",
                stringify!(size)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MIDI_event_t>())).midi_message as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MIDI_event_t),
                "::",
                stringify!(midi_message)
            )
        );
    }
    #[repr(C)]
    pub struct MIDI_eventlist__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct MIDI_eventlist {
        pub vtable_: *const MIDI_eventlist__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_MIDI_eventlist() {
        assert_eq!(
            ::std::mem::size_of::<MIDI_eventlist>(),
            8usize,
            concat!("Size of: ", stringify!(MIDI_eventlist))
        );
        assert_eq!(
            ::std::mem::align_of::<MIDI_eventlist>(),
            8usize,
            concat!("Alignment of ", stringify!(MIDI_eventlist))
        );
    }
    #[doc = " PCM source API"]
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct PCM_source_transfer_t {
        pub time_s: f64,
        pub samplerate: f64,
        pub nch: ::std::os::raw::c_int,
        pub length: ::std::os::raw::c_int,
        pub samples: *mut root::ReaSample,
        pub samples_out: ::std::os::raw::c_int,
        pub midi_events: *mut root::MIDI_eventlist,
        pub approximate_playback_latency: f64,
        pub absolute_time_s: f64,
        pub force_bpm: f64,
    }
    #[test]
    fn bindgen_test_layout_PCM_source_transfer_t() {
        assert_eq!(
            ::std::mem::size_of::<PCM_source_transfer_t>(),
            72usize,
            concat!("Size of: ", stringify!(PCM_source_transfer_t))
        );
        assert_eq!(
            ::std::mem::align_of::<PCM_source_transfer_t>(),
            8usize,
            concat!("Alignment of ", stringify!(PCM_source_transfer_t))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).time_s as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(time_s)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).samplerate as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(samplerate)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<PCM_source_transfer_t>())).nch as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(nch)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).length as *const _ as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(length)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).samples as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(samples)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).samples_out as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(samples_out)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).midi_events as *const _ as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(midi_events)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).approximate_playback_latency
                    as *const _ as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(approximate_playback_latency)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).absolute_time_s as *const _
                    as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(absolute_time_s)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).force_bpm as *const _ as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(force_bpm)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct PCM_source_peaktransfer_t {
        pub start_time: f64,
        pub peakrate: f64,
        pub numpeak_points: ::std::os::raw::c_int,
        pub nchpeaks: ::std::os::raw::c_int,
        pub peaks: *mut root::ReaSample,
        pub peaks_out: ::std::os::raw::c_int,
        pub output_mode: ::std::os::raw::c_int,
        pub absolute_time_s: f64,
        pub peaks_minvals: *mut root::ReaSample,
        pub peaks_minvals_used: ::std::os::raw::c_int,
        pub samplerate: f64,
        pub exp: [*mut ::std::os::raw::c_int; 30usize],
    }
    pub const PCM_source_peaktransfer_t_PEAKTRANSFER_PEAKS_MODE:
        root::PCM_source_peaktransfer_t__bindgen_ty_1 = 0;
    pub const PCM_source_peaktransfer_t_PEAKTRANSFER_WAVEFORM_MODE:
        root::PCM_source_peaktransfer_t__bindgen_ty_1 = 1;
    pub const PCM_source_peaktransfer_t_PEAKTRANSFER_MIDI_NOTE_MODE:
        root::PCM_source_peaktransfer_t__bindgen_ty_1 = 2;
    pub const PCM_source_peaktransfer_t_PEAKTRANSFER_MIDI_DRUM_MODE:
        root::PCM_source_peaktransfer_t__bindgen_ty_1 = 3;
    pub const PCM_source_peaktransfer_t_PEAKTRANSFER_MIDI_DRUM_TRIANGLE_MODE:
        root::PCM_source_peaktransfer_t__bindgen_ty_1 = 4;
    pub type PCM_source_peaktransfer_t__bindgen_ty_1 = u32;
    #[test]
    fn bindgen_test_layout_PCM_source_peaktransfer_t() {
        assert_eq!(
            ::std::mem::size_of::<PCM_source_peaktransfer_t>(),
            312usize,
            concat!("Size of: ", stringify!(PCM_source_peaktransfer_t))
        );
        assert_eq!(
            ::std::mem::align_of::<PCM_source_peaktransfer_t>(),
            8usize,
            concat!("Alignment of ", stringify!(PCM_source_peaktransfer_t))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).start_time as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(start_time)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).peakrate as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(peakrate)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).numpeak_points as *const _
                    as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(numpeak_points)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).nchpeaks as *const _ as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(nchpeaks)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).peaks as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(peaks)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).peaks_out as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(peaks_out)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).output_mode as *const _
                    as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(output_mode)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).absolute_time_s as *const _
                    as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(absolute_time_s)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).peaks_minvals as *const _
                    as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(peaks_minvals)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).peaks_minvals_used as *const _
                    as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(peaks_minvals_used)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).samplerate as *const _
                    as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(samplerate)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).exp as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(exp)
            )
        );
    }
    #[repr(C)]
    pub struct PCM_source__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct PCM_source {
        pub vtable_: *const PCM_source__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_PCM_source() {
        assert_eq!(
            ::std::mem::size_of::<PCM_source>(),
            8usize,
            concat!("Size of: ", stringify!(PCM_source))
        );
        assert_eq!(
            ::std::mem::align_of::<PCM_source>(),
            8usize,
            concat!("Alignment of ", stringify!(PCM_source))
        );
    }
    #[repr(C)]
    pub struct ISimpleMediaDecoder__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct ISimpleMediaDecoder {
        pub vtable_: *const ISimpleMediaDecoder__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_ISimpleMediaDecoder() {
        assert_eq!(
            ::std::mem::size_of::<ISimpleMediaDecoder>(),
            8usize,
            concat!("Size of: ", stringify!(ISimpleMediaDecoder))
        );
        assert_eq!(
            ::std::mem::align_of::<ISimpleMediaDecoder>(),
            8usize,
            concat!("Alignment of ", stringify!(ISimpleMediaDecoder))
        );
    }
    #[repr(C)]
    pub struct PCM_sink__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, PartialEq)]
    pub struct PCM_sink {
        pub vtable_: *const PCM_sink__bindgen_vtable,
        pub m_st: f64,
    }
    #[test]
    fn bindgen_test_layout_PCM_sink() {
        assert_eq!(
            ::std::mem::size_of::<PCM_sink>(),
            16usize,
            concat!("Size of: ", stringify!(PCM_sink))
        );
        assert_eq!(
            ::std::mem::align_of::<PCM_sink>(),
            8usize,
            concat!("Alignment of ", stringify!(PCM_sink))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<PCM_sink>())).m_st as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_sink),
                "::",
                stringify!(m_st)
            )
        );
    }
    #[repr(C)]
    pub struct REAPER_Resample_Interface__bindgen_vtable(::std::os::raw::c_void);
    #[doc = " Resampler API (plug-ins can use this for SRC)"]
    #[doc = ""]
    #[doc = ""]
    #[doc = " See API functions Resampler_Create() and Resample_EnumModes()"]
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct REAPER_Resample_Interface {
        pub vtable_: *const REAPER_Resample_Interface__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_REAPER_Resample_Interface() {
        assert_eq!(
            ::std::mem::size_of::<REAPER_Resample_Interface>(),
            8usize,
            concat!("Size of: ", stringify!(REAPER_Resample_Interface))
        );
        assert_eq!(
            ::std::mem::align_of::<REAPER_Resample_Interface>(),
            8usize,
            concat!("Alignment of ", stringify!(REAPER_Resample_Interface))
        );
    }
    #[repr(C)]
    pub struct IReaperPitchShift__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct IReaperPitchShift {
        pub vtable_: *const IReaperPitchShift__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_IReaperPitchShift() {
        assert_eq!(
            ::std::mem::size_of::<IReaperPitchShift>(),
            8usize,
            concat!("Size of: ", stringify!(IReaperPitchShift))
        );
        assert_eq!(
            ::std::mem::align_of::<IReaperPitchShift>(),
            8usize,
            concat!("Alignment of ", stringify!(IReaperPitchShift))
        );
    }
    #[repr(C)]
    pub struct REAPER_PeakGet_Interface__bindgen_vtable(::std::os::raw::c_void);
    #[doc = " Peak getting/building API"]
    #[doc = ""]
    #[doc = " These are really only needed if you implement a PCM_source or PCM_sink."]
    #[doc = ""]
    #[doc = " See functions PeakGet_Create(), PeakBuild_Create(), GetPeakFileName(), ClearPeakCache()"]
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct REAPER_PeakGet_Interface {
        pub vtable_: *const REAPER_PeakGet_Interface__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_REAPER_PeakGet_Interface() {
        assert_eq!(
            ::std::mem::size_of::<REAPER_PeakGet_Interface>(),
            8usize,
            concat!("Size of: ", stringify!(REAPER_PeakGet_Interface))
        );
        assert_eq!(
            ::std::mem::align_of::<REAPER_PeakGet_Interface>(),
            8usize,
            concat!("Alignment of ", stringify!(REAPER_PeakGet_Interface))
        );
    }
    #[repr(C)]
    pub struct REAPER_PeakBuild_Interface__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct REAPER_PeakBuild_Interface {
        pub vtable_: *const REAPER_PeakBuild_Interface__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_REAPER_PeakBuild_Interface() {
        assert_eq!(
            ::std::mem::size_of::<REAPER_PeakBuild_Interface>(),
            8usize,
            concat!("Size of: ", stringify!(REAPER_PeakBuild_Interface))
        );
        assert_eq!(
            ::std::mem::align_of::<REAPER_PeakBuild_Interface>(),
            8usize,
            concat!("Alignment of ", stringify!(REAPER_PeakBuild_Interface))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct gaccel_register_t {
        pub accel: root::ACCEL,
        pub desc: *const ::std::os::raw::c_char,
    }
    #[test]
    fn bindgen_test_layout_gaccel_register_t() {
        assert_eq!(
            ::std::mem::size_of::<gaccel_register_t>(),
            16usize,
            concat!("Size of: ", stringify!(gaccel_register_t))
        );
        assert_eq!(
            ::std::mem::align_of::<gaccel_register_t>(),
            8usize,
            concat!("Alignment of ", stringify!(gaccel_register_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<gaccel_register_t>())).accel as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gaccel_register_t),
                "::",
                stringify!(accel)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<gaccel_register_t>())).desc as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(gaccel_register_t),
                "::",
                stringify!(desc)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct audio_hook_register_t {
        pub OnAudioBuffer: ::std::option::Option<
            unsafe extern "C" fn(
                isPost: bool,
                len: ::std::os::raw::c_int,
                srate: f64,
                reg: *mut root::audio_hook_register_t,
            ),
        >,
        pub userdata1: *mut ::std::os::raw::c_void,
        pub userdata2: *mut ::std::os::raw::c_void,
        pub input_nch: ::std::os::raw::c_int,
        pub output_nch: ::std::os::raw::c_int,
        pub GetBuffer: ::std::option::Option<
            unsafe extern "C" fn(
                isOutput: bool,
                idx: ::std::os::raw::c_int,
            ) -> *mut root::ReaSample,
        >,
    }
    #[test]
    fn bindgen_test_layout_audio_hook_register_t() {
        assert_eq!(
            ::std::mem::size_of::<audio_hook_register_t>(),
            40usize,
            concat!("Size of: ", stringify!(audio_hook_register_t))
        );
        assert_eq!(
            ::std::mem::align_of::<audio_hook_register_t>(),
            8usize,
            concat!("Alignment of ", stringify!(audio_hook_register_t))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).OnAudioBuffer as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(OnAudioBuffer)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).userdata1 as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(userdata1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).userdata2 as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(userdata2)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).input_nch as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(input_nch)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).output_nch as *const _ as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(output_nch)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).GetBuffer as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(GetBuffer)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct KbdCmd {
        pub cmd: root::DWORD,
        pub text: *const ::std::os::raw::c_char,
    }
    #[test]
    fn bindgen_test_layout_KbdCmd() {
        assert_eq!(
            ::std::mem::size_of::<KbdCmd>(),
            16usize,
            concat!("Size of: ", stringify!(KbdCmd))
        );
        assert_eq!(
            ::std::mem::align_of::<KbdCmd>(),
            8usize,
            concat!("Alignment of ", stringify!(KbdCmd))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdCmd>())).cmd as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdCmd),
                "::",
                stringify!(cmd)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdCmd>())).text as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdCmd),
                "::",
                stringify!(text)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct KbdKeyBindingInfo {
        pub key: ::std::os::raw::c_int,
        pub cmd: ::std::os::raw::c_int,
        pub flags: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_KbdKeyBindingInfo() {
        assert_eq!(
            ::std::mem::size_of::<KbdKeyBindingInfo>(),
            12usize,
            concat!("Size of: ", stringify!(KbdKeyBindingInfo))
        );
        assert_eq!(
            ::std::mem::align_of::<KbdKeyBindingInfo>(),
            4usize,
            concat!("Alignment of ", stringify!(KbdKeyBindingInfo))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdKeyBindingInfo>())).key as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdKeyBindingInfo),
                "::",
                stringify!(key)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdKeyBindingInfo>())).cmd as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdKeyBindingInfo),
                "::",
                stringify!(cmd)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdKeyBindingInfo>())).flags as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdKeyBindingInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct KbdSectionInfo {
        pub uniqueID: ::std::os::raw::c_int,
        pub name: *const ::std::os::raw::c_char,
        pub action_list: *mut root::KbdCmd,
        pub action_list_cnt: ::std::os::raw::c_int,
        pub def_keys: *mut root::KbdKeyBindingInfo,
        pub def_keys_cnt: ::std::os::raw::c_int,
        pub onAction: ::std::option::Option<
            unsafe extern "C" fn(
                cmd: ::std::os::raw::c_int,
                val: ::std::os::raw::c_int,
                valhw: ::std::os::raw::c_int,
                relmode: ::std::os::raw::c_int,
                hwnd: root::HWND,
            ) -> bool,
        >,
        pub accels: *mut ::std::os::raw::c_void,
        pub recent_cmds: *mut ::std::os::raw::c_void,
        pub extended_data: [*mut ::std::os::raw::c_void; 32usize],
    }
    #[test]
    fn bindgen_test_layout_KbdSectionInfo() {
        assert_eq!(
            ::std::mem::size_of::<KbdSectionInfo>(),
            328usize,
            concat!("Size of: ", stringify!(KbdSectionInfo))
        );
        assert_eq!(
            ::std::mem::align_of::<KbdSectionInfo>(),
            8usize,
            concat!("Alignment of ", stringify!(KbdSectionInfo))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).uniqueID as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(uniqueID)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).name as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).action_list as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(action_list)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<KbdSectionInfo>())).action_list_cnt as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(action_list_cnt)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).def_keys as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(def_keys)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).def_keys_cnt as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(def_keys_cnt)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).onAction as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(onAction)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).accels as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(accels)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).recent_cmds as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(recent_cmds)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<KbdSectionInfo>())).extended_data as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(extended_data)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct preview_register_t {
        pub mutex: root::pthread_mutex_t,
        pub src: *mut root::PCM_source,
        pub m_out_chan: ::std::os::raw::c_int,
        pub curpos: f64,
        pub loop_: bool,
        pub volume: f64,
        pub peakvol: [f64; 2usize],
        pub preview_track: *mut ::std::os::raw::c_void,
    }
    #[test]
    fn bindgen_test_layout_preview_register_t() {
        assert_eq!(
            ::std::mem::size_of::<preview_register_t>(),
            104usize,
            concat!("Size of: ", stringify!(preview_register_t))
        );
        assert_eq!(
            ::std::mem::align_of::<preview_register_t>(),
            8usize,
            concat!("Alignment of ", stringify!(preview_register_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).mutex as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(mutex)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).src as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(src)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<preview_register_t>())).m_out_chan as *const _ as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(m_out_chan)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).curpos as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(curpos)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).loop_ as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(loop_)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).volume as *const _ as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(volume)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).peakvol as *const _ as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(peakvol)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<preview_register_t>())).preview_track as *const _ as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(preview_track)
            )
        );
    }
    pub type screensetNewCallbackFunc = ::std::option::Option<
        unsafe extern "C" fn(
            action: ::std::os::raw::c_int,
            id: *const ::std::os::raw::c_char,
            param: *mut ::std::os::raw::c_void,
            actionParm: *mut ::std::os::raw::c_void,
            actionParmSize: ::std::os::raw::c_int,
        ) -> root::LRESULT,
    >;
    #[repr(C)]
    pub struct midi_Output__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct midi_Output {
        pub vtable_: *const midi_Output__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_midi_Output() {
        assert_eq!(
            ::std::mem::size_of::<midi_Output>(),
            8usize,
            concat!("Size of: ", stringify!(midi_Output))
        );
        assert_eq!(
            ::std::mem::align_of::<midi_Output>(),
            8usize,
            concat!("Alignment of ", stringify!(midi_Output))
        );
    }
    #[repr(C)]
    pub struct midi_Input__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct midi_Input {
        pub vtable_: *const midi_Input__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_midi_Input() {
        assert_eq!(
            ::std::mem::size_of::<midi_Input>(),
            8usize,
            concat!("Size of: ", stringify!(midi_Input))
        );
        assert_eq!(
            ::std::mem::align_of::<midi_Input>(),
            8usize,
            concat!("Alignment of ", stringify!(midi_Input))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct ReaProject {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct MediaTrack {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct MediaItem {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct MediaItem_Take {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct TrackEnvelope {
        _unused: [u8; 0],
    }
    #[repr(C)]
    pub struct IReaperControlSurface__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct IReaperControlSurface {
        pub vtable_: *const IReaperControlSurface__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_IReaperControlSurface() {
        assert_eq!(
            ::std::mem::size_of::<IReaperControlSurface>(),
            8usize,
            concat!("Size of: ", stringify!(IReaperControlSurface))
        );
        assert_eq!(
            ::std::mem::align_of::<IReaperControlSurface>(),
            8usize,
            concat!("Alignment of ", stringify!(IReaperControlSurface))
        );
    }
    pub mod reaper_functions {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub type LICE_pixel = ::std::os::raw::c_uint;
        pub type LICE_pixel_chan = ::std::os::raw::c_uchar;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct LICE_IBitmap {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct LICE_IFont {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct WDL_VirtualWnd_BGCfg {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AudioAccessor {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct joystick_device {
            _unused: [u8; 0],
        }
        extern "C" {
