/* automatically generated by rust-bindgen */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[allow(unused_imports)]
    use self::super::root;
    pub const REAPER_PLUGIN_VERSION: u32 = 526;
    pub const CSURF_EXT_RESET: u32 = 131071;
    pub const CSURF_EXT_SETINPUTMONITOR: u32 = 65537;
    pub const CSURF_EXT_SETMETRONOME: u32 = 65538;
    pub const CSURF_EXT_SETAUTORECARM: u32 = 65539;
    pub const CSURF_EXT_SETRECMODE: u32 = 65540;
    pub const CSURF_EXT_SETSENDVOLUME: u32 = 65541;
    pub const CSURF_EXT_SETSENDPAN: u32 = 65542;
    pub const CSURF_EXT_SETFXENABLED: u32 = 65543;
    pub const CSURF_EXT_SETFXPARAM: u32 = 65544;
    pub const CSURF_EXT_SETLASTTOUCHEDFX: u32 = 65546;
    pub const CSURF_EXT_SETFOCUSEDFX: u32 = 65547;
    pub const CSURF_EXT_SETLASTTOUCHEDTRACK: u32 = 65548;
    pub const CSURF_EXT_SETMIXERSCROLL: u32 = 65549;
    pub const CSURF_EXT_SETBPMANDPLAYRATE: u32 = 65545;
    pub const CSURF_EXT_SETPAN_EX: u32 = 65550;
    pub const CSURF_EXT_SETRECVVOLUME: u32 = 65552;
    pub const CSURF_EXT_SETRECVPAN: u32 = 65553;
    pub const CSURF_EXT_SETFXOPEN: u32 = 65554;
    pub const CSURF_EXT_SETFXCHANGE: u32 = 65555;
    pub const CSURF_EXT_SETPROJECTMARKERCHANGE: u32 = 65556;
    pub const CSURF_EXT_SETFXPARAM_RECFX: u32 = 65560;
    pub const CSURF_EXT_SUPPORTS_EXTENDED_TOUCH: u32 = 524289;
    pub type ReaSample = f64;
    pub type DWORD = ::std::os::raw::c_ulong;
    pub type BYTE = ::std::os::raw::c_uchar;
    pub type WORD = ::std::os::raw::c_ushort;
    pub type UINT = ::std::os::raw::c_uint;
    pub type INT_PTR = ::std::os::raw::c_longlong;
    pub type UINT_PTR = ::std::os::raw::c_ulonglong;
    pub type LONG_PTR = ::std::os::raw::c_longlong;
    pub type ULONG_PTR = ::std::os::raw::c_ulonglong;
    pub type LONG = ::std::os::raw::c_long;
    pub type HANDLE = *mut ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct _LIST_ENTRY {
        pub Flink: *mut root::_LIST_ENTRY,
        pub Blink: *mut root::_LIST_ENTRY,
    }
    #[test]
    fn bindgen_test_layout__LIST_ENTRY() {
        assert_eq!(
            ::std::mem::size_of::<_LIST_ENTRY>(),
            16usize,
            concat!("Size of: ", stringify!(_LIST_ENTRY))
        );
        assert_eq!(
            ::std::mem::align_of::<_LIST_ENTRY>(),
            8usize,
            concat!("Alignment of ", stringify!(_LIST_ENTRY))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_LIST_ENTRY>())).Flink as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_LIST_ENTRY),
                "::",
                stringify!(Flink)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_LIST_ENTRY>())).Blink as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_LIST_ENTRY),
                "::",
                stringify!(Blink)
            )
        );
    }
    pub type LIST_ENTRY = root::_LIST_ENTRY;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct _GUID {
        pub Data1: ::std::os::raw::c_ulong,
        pub Data2: ::std::os::raw::c_ushort,
        pub Data3: ::std::os::raw::c_ushort,
        pub Data4: [::std::os::raw::c_uchar; 8usize],
    }
    #[test]
    fn bindgen_test_layout__GUID() {
        assert_eq!(
            ::std::mem::size_of::<_GUID>(),
            16usize,
            concat!("Size of: ", stringify!(_GUID))
        );
        assert_eq!(
            ::std::mem::align_of::<_GUID>(),
            4usize,
            concat!("Alignment of ", stringify!(_GUID))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_GUID>())).Data1 as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_GUID),
                "::",
                stringify!(Data1)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_GUID>())).Data2 as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_GUID),
                "::",
                stringify!(Data2)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_GUID>())).Data3 as *const _ as usize },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(_GUID),
                "::",
                stringify!(Data3)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_GUID>())).Data4 as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_GUID),
                "::",
                stringify!(Data4)
            )
        );
    }
    pub type GUID = root::_GUID;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct _RTL_CRITICAL_SECTION_DEBUG {
        pub Type: root::WORD,
        pub CreatorBackTraceIndex: root::WORD,
        pub CriticalSection: *mut root::_RTL_CRITICAL_SECTION,
        pub ProcessLocksList: root::LIST_ENTRY,
        pub EntryCount: root::DWORD,
        pub ContentionCount: root::DWORD,
        pub Flags: root::DWORD,
        pub CreatorBackTraceIndexHigh: root::WORD,
        pub SpareWORD: root::WORD,
    }
    #[test]
    fn bindgen_test_layout__RTL_CRITICAL_SECTION_DEBUG() {
        assert_eq!(
            ::std::mem::size_of::<_RTL_CRITICAL_SECTION_DEBUG>(),
            48usize,
            concat!("Size of: ", stringify!(_RTL_CRITICAL_SECTION_DEBUG))
        );
        assert_eq!(
            ::std::mem::align_of::<_RTL_CRITICAL_SECTION_DEBUG>(),
            8usize,
            concat!("Alignment of ", stringify!(_RTL_CRITICAL_SECTION_DEBUG))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION_DEBUG>())).Type as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION_DEBUG),
                "::",
                stringify!(Type)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION_DEBUG>())).CreatorBackTraceIndex
                    as *const _ as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION_DEBUG),
                "::",
                stringify!(CreatorBackTraceIndex)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION_DEBUG>())).CriticalSection as *const _
                    as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION_DEBUG),
                "::",
                stringify!(CriticalSection)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION_DEBUG>())).ProcessLocksList as *const _
                    as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION_DEBUG),
                "::",
                stringify!(ProcessLocksList)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION_DEBUG>())).EntryCount as *const _
                    as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION_DEBUG),
                "::",
                stringify!(EntryCount)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION_DEBUG>())).ContentionCount as *const _
                    as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION_DEBUG),
                "::",
                stringify!(ContentionCount)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION_DEBUG>())).Flags as *const _ as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION_DEBUG),
                "::",
                stringify!(Flags)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION_DEBUG>())).CreatorBackTraceIndexHigh
                    as *const _ as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION_DEBUG),
                "::",
                stringify!(CreatorBackTraceIndexHigh)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION_DEBUG>())).SpareWORD as *const _
                    as usize
            },
            46usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION_DEBUG),
                "::",
                stringify!(SpareWORD)
            )
        );
    }
    pub type PRTL_CRITICAL_SECTION_DEBUG = *mut root::_RTL_CRITICAL_SECTION_DEBUG;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct _RTL_CRITICAL_SECTION {
        pub DebugInfo: root::PRTL_CRITICAL_SECTION_DEBUG,
        pub LockCount: root::LONG,
        pub RecursionCount: root::LONG,
        pub OwningThread: root::HANDLE,
        pub LockSemaphore: root::HANDLE,
        pub SpinCount: root::ULONG_PTR,
    }
    #[test]
    fn bindgen_test_layout__RTL_CRITICAL_SECTION() {
        assert_eq!(
            ::std::mem::size_of::<_RTL_CRITICAL_SECTION>(),
            40usize,
            concat!("Size of: ", stringify!(_RTL_CRITICAL_SECTION))
        );
        assert_eq!(
            ::std::mem::align_of::<_RTL_CRITICAL_SECTION>(),
            8usize,
            concat!("Alignment of ", stringify!(_RTL_CRITICAL_SECTION))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION>())).DebugInfo as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION),
                "::",
                stringify!(DebugInfo)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION>())).LockCount as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION),
                "::",
                stringify!(LockCount)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION>())).RecursionCount as *const _
                    as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION),
                "::",
                stringify!(RecursionCount)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION>())).OwningThread as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION),
                "::",
                stringify!(OwningThread)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION>())).LockSemaphore as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION),
                "::",
                stringify!(LockSemaphore)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<_RTL_CRITICAL_SECTION>())).SpinCount as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_RTL_CRITICAL_SECTION),
                "::",
                stringify!(SpinCount)
            )
        );
    }
    pub type RTL_CRITICAL_SECTION = root::_RTL_CRITICAL_SECTION;
    pub type WPARAM = root::UINT_PTR;
    pub type LPARAM = root::LONG_PTR;
    pub type LRESULT = root::LONG_PTR;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct HINSTANCE__ {
        pub unused: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_HINSTANCE__() {
        assert_eq!(
            ::std::mem::size_of::<HINSTANCE__>(),
            4usize,
            concat!("Size of: ", stringify!(HINSTANCE__))
        );
        assert_eq!(
            ::std::mem::align_of::<HINSTANCE__>(),
            4usize,
            concat!("Alignment of ", stringify!(HINSTANCE__))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<HINSTANCE__>())).unused as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HINSTANCE__),
                "::",
                stringify!(unused)
            )
        );
    }
    pub type HINSTANCE = *mut root::HINSTANCE__;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct HWND__ {
        pub unused: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_HWND__() {
        assert_eq!(
            ::std::mem::size_of::<HWND__>(),
            4usize,
            concat!("Size of: ", stringify!(HWND__))
        );
        assert_eq!(
            ::std::mem::align_of::<HWND__>(),
            4usize,
            concat!("Alignment of ", stringify!(HWND__))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<HWND__>())).unused as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HWND__),
                "::",
                stringify!(unused)
            )
        );
    }
    pub type HWND = *mut root::HWND__;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct HDC__ {
        pub unused: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_HDC__() {
        assert_eq!(
            ::std::mem::size_of::<HDC__>(),
            4usize,
            concat!("Size of: ", stringify!(HDC__))
        );
        assert_eq!(
            ::std::mem::align_of::<HDC__>(),
            4usize,
            concat!("Alignment of ", stringify!(HDC__))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<HDC__>())).unused as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HDC__),
                "::",
                stringify!(unused)
            )
        );
    }
    pub type HDC = *mut root::HDC__;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct HFONT__ {
        pub unused: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_HFONT__() {
        assert_eq!(
            ::std::mem::size_of::<HFONT__>(),
            4usize,
            concat!("Size of: ", stringify!(HFONT__))
        );
        assert_eq!(
            ::std::mem::align_of::<HFONT__>(),
            4usize,
            concat!("Alignment of ", stringify!(HFONT__))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<HFONT__>())).unused as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HFONT__),
                "::",
                stringify!(unused)
            )
        );
    }
    pub type HFONT = *mut root::HFONT__;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct HMENU__ {
        pub unused: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_HMENU__() {
        assert_eq!(
            ::std::mem::size_of::<HMENU__>(),
            4usize,
            concat!("Size of: ", stringify!(HMENU__))
        );
        assert_eq!(
            ::std::mem::align_of::<HMENU__>(),
            4usize,
            concat!("Alignment of ", stringify!(HMENU__))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<HMENU__>())).unused as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HMENU__),
                "::",
                stringify!(unused)
            )
        );
    }
    pub type HMENU = *mut root::HMENU__;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct tagRECT {
        pub left: root::LONG,
        pub top: root::LONG,
        pub right: root::LONG,
        pub bottom: root::LONG,
    }
    #[test]
    fn bindgen_test_layout_tagRECT() {
        assert_eq!(
            ::std::mem::size_of::<tagRECT>(),
            16usize,
            concat!("Size of: ", stringify!(tagRECT))
        );
        assert_eq!(
            ::std::mem::align_of::<tagRECT>(),
            4usize,
            concat!("Alignment of ", stringify!(tagRECT))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagRECT>())).left as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(tagRECT),
                "::",
                stringify!(left)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagRECT>())).top as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(tagRECT),
                "::",
                stringify!(top)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagRECT>())).right as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(tagRECT),
                "::",
                stringify!(right)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagRECT>())).bottom as *const _ as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(tagRECT),
                "::",
                stringify!(bottom)
            )
        );
    }
    pub type RECT = root::tagRECT;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct tagPOINT {
        pub x: root::LONG,
        pub y: root::LONG,
    }
    #[test]
    fn bindgen_test_layout_tagPOINT() {
        assert_eq!(
            ::std::mem::size_of::<tagPOINT>(),
            8usize,
            concat!("Size of: ", stringify!(tagPOINT))
        );
        assert_eq!(
            ::std::mem::align_of::<tagPOINT>(),
            4usize,
            concat!("Alignment of ", stringify!(tagPOINT))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagPOINT>())).x as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(tagPOINT),
                "::",
                stringify!(x)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagPOINT>())).y as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(tagPOINT),
                "::",
                stringify!(y)
            )
        );
    }
    pub type POINT = root::tagPOINT;
    pub type CRITICAL_SECTION = root::RTL_CRITICAL_SECTION;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct tagMSG {
        pub hwnd: root::HWND,
        pub message: root::UINT,
        pub wParam: root::WPARAM,
        pub lParam: root::LPARAM,
        pub time: root::DWORD,
        pub pt: root::POINT,
    }
    #[test]
    fn bindgen_test_layout_tagMSG() {
        assert_eq!(
            ::std::mem::size_of::<tagMSG>(),
            48usize,
            concat!("Size of: ", stringify!(tagMSG))
        );
        assert_eq!(
            ::std::mem::align_of::<tagMSG>(),
            8usize,
            concat!("Alignment of ", stringify!(tagMSG))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagMSG>())).hwnd as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(tagMSG),
                "::",
                stringify!(hwnd)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagMSG>())).message as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(tagMSG),
                "::",
                stringify!(message)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagMSG>())).wParam as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(tagMSG),
                "::",
                stringify!(wParam)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagMSG>())).lParam as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(tagMSG),
                "::",
                stringify!(lParam)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagMSG>())).time as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(tagMSG),
                "::",
                stringify!(time)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagMSG>())).pt as *const _ as usize },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(tagMSG),
                "::",
                stringify!(pt)
            )
        );
    }
    pub type MSG = root::tagMSG;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct tagACCEL {
        pub fVirt: root::BYTE,
        pub key: root::WORD,
        pub cmd: root::WORD,
    }
    #[test]
    fn bindgen_test_layout_tagACCEL() {
        assert_eq!(
            ::std::mem::size_of::<tagACCEL>(),
            6usize,
            concat!("Size of: ", stringify!(tagACCEL))
        );
        assert_eq!(
            ::std::mem::align_of::<tagACCEL>(),
            2usize,
            concat!("Alignment of ", stringify!(tagACCEL))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagACCEL>())).fVirt as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(tagACCEL),
                "::",
                stringify!(fVirt)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagACCEL>())).key as *const _ as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(tagACCEL),
                "::",
                stringify!(key)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<tagACCEL>())).cmd as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(tagACCEL),
                "::",
                stringify!(cmd)
            )
        );
    }
    pub type ACCEL = root::tagACCEL;
    extern "C" {
        pub fn GetActiveWindow() -> root::HWND;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct reaper_plugin_info_t {
        pub caller_version: ::std::os::raw::c_int,
        pub hwnd_main: root::HWND,
        pub Register: ::std::option::Option<
            unsafe extern "C" fn(
                name: *const ::std::os::raw::c_char,
                infostruct: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        pub GetFunc: ::std::option::Option<
            unsafe extern "C" fn(
                name: *const ::std::os::raw::c_char,
            ) -> *mut ::std::os::raw::c_void,
        >,
    }
    #[test]
    fn bindgen_test_layout_reaper_plugin_info_t() {
        assert_eq!(
            ::std::mem::size_of::<reaper_plugin_info_t>(),
            32usize,
            concat!("Size of: ", stringify!(reaper_plugin_info_t))
        );
        assert_eq!(
            ::std::mem::align_of::<reaper_plugin_info_t>(),
            8usize,
            concat!("Alignment of ", stringify!(reaper_plugin_info_t))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<reaper_plugin_info_t>())).caller_version as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(reaper_plugin_info_t),
                "::",
                stringify!(caller_version)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<reaper_plugin_info_t>())).hwnd_main as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(reaper_plugin_info_t),
                "::",
                stringify!(hwnd_main)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<reaper_plugin_info_t>())).Register as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(reaper_plugin_info_t),
                "::",
                stringify!(Register)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<reaper_plugin_info_t>())).GetFunc as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(reaper_plugin_info_t),
                "::",
                stringify!(GetFunc)
            )
        );
    }
    #[repr(C)]
    pub struct ProjectStateContext__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct ProjectStateContext {
        pub vtable_: *const ProjectStateContext__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_ProjectStateContext() {
        assert_eq!(
            ::std::mem::size_of::<ProjectStateContext>(),
            8usize,
            concat!("Size of: ", stringify!(ProjectStateContext))
        );
        assert_eq!(
            ::std::mem::align_of::<ProjectStateContext>(),
            8usize,
            concat!("Alignment of ", stringify!(ProjectStateContext))
        );
    }
    #[doc = " MIDI event definition and abstract list"]
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct MIDI_event_t {
        pub frame_offset: ::std::os::raw::c_int,
        pub size: ::std::os::raw::c_int,
        pub midi_message: [::std::os::raw::c_uchar; 4usize],
    }
    #[test]
    fn bindgen_test_layout_MIDI_event_t() {
        assert_eq!(
            ::std::mem::size_of::<MIDI_event_t>(),
            12usize,
            concat!("Size of: ", stringify!(MIDI_event_t))
        );
        assert_eq!(
            ::std::mem::align_of::<MIDI_event_t>(),
            4usize,
            concat!("Alignment of ", stringify!(MIDI_event_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MIDI_event_t>())).frame_offset as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MIDI_event_t),
                "::",
                stringify!(frame_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MIDI_event_t>())).size as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(MIDI_event_t),
                "::",
                stringify!(size)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<MIDI_event_t>())).midi_message as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MIDI_event_t),
                "::",
                stringify!(midi_message)
            )
        );
    }
    #[repr(C)]
    pub struct MIDI_eventlist__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct MIDI_eventlist {
        pub vtable_: *const MIDI_eventlist__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_MIDI_eventlist() {
        assert_eq!(
            ::std::mem::size_of::<MIDI_eventlist>(),
            8usize,
            concat!("Size of: ", stringify!(MIDI_eventlist))
        );
        assert_eq!(
            ::std::mem::align_of::<MIDI_eventlist>(),
            8usize,
            concat!("Alignment of ", stringify!(MIDI_eventlist))
        );
    }
    #[doc = " PCM source API"]
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct PCM_source_transfer_t {
        pub time_s: f64,
        pub samplerate: f64,
        pub nch: ::std::os::raw::c_int,
        pub length: ::std::os::raw::c_int,
        pub samples: *mut root::ReaSample,
        pub samples_out: ::std::os::raw::c_int,
        pub midi_events: *mut root::MIDI_eventlist,
        pub approximate_playback_latency: f64,
        pub absolute_time_s: f64,
        pub force_bpm: f64,
    }
    #[test]
    fn bindgen_test_layout_PCM_source_transfer_t() {
        assert_eq!(
            ::std::mem::size_of::<PCM_source_transfer_t>(),
            72usize,
            concat!("Size of: ", stringify!(PCM_source_transfer_t))
        );
        assert_eq!(
            ::std::mem::align_of::<PCM_source_transfer_t>(),
            8usize,
            concat!("Alignment of ", stringify!(PCM_source_transfer_t))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).time_s as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(time_s)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).samplerate as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(samplerate)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<PCM_source_transfer_t>())).nch as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(nch)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).length as *const _ as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(length)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).samples as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(samples)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).samples_out as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(samples_out)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).midi_events as *const _ as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(midi_events)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).approximate_playback_latency
                    as *const _ as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(approximate_playback_latency)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).absolute_time_s as *const _
                    as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(absolute_time_s)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_transfer_t>())).force_bpm as *const _ as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_transfer_t),
                "::",
                stringify!(force_bpm)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct PCM_source_peaktransfer_t {
        pub start_time: f64,
        pub peakrate: f64,
        pub numpeak_points: ::std::os::raw::c_int,
        pub nchpeaks: ::std::os::raw::c_int,
        pub peaks: *mut root::ReaSample,
        pub peaks_out: ::std::os::raw::c_int,
        pub output_mode: ::std::os::raw::c_int,
        pub absolute_time_s: f64,
        pub peaks_minvals: *mut root::ReaSample,
        pub peaks_minvals_used: ::std::os::raw::c_int,
        pub samplerate: f64,
        pub exp: [*mut ::std::os::raw::c_int; 30usize],
    }
    pub const PCM_source_peaktransfer_t_PEAKTRANSFER_PEAKS_MODE:
        root::PCM_source_peaktransfer_t__bindgen_ty_1 = 0;
    pub const PCM_source_peaktransfer_t_PEAKTRANSFER_WAVEFORM_MODE:
        root::PCM_source_peaktransfer_t__bindgen_ty_1 = 1;
    pub const PCM_source_peaktransfer_t_PEAKTRANSFER_MIDI_NOTE_MODE:
        root::PCM_source_peaktransfer_t__bindgen_ty_1 = 2;
    pub const PCM_source_peaktransfer_t_PEAKTRANSFER_MIDI_DRUM_MODE:
        root::PCM_source_peaktransfer_t__bindgen_ty_1 = 3;
    pub const PCM_source_peaktransfer_t_PEAKTRANSFER_MIDI_DRUM_TRIANGLE_MODE:
        root::PCM_source_peaktransfer_t__bindgen_ty_1 = 4;
    pub type PCM_source_peaktransfer_t__bindgen_ty_1 = i32;
    #[test]
    fn bindgen_test_layout_PCM_source_peaktransfer_t() {
        assert_eq!(
            ::std::mem::size_of::<PCM_source_peaktransfer_t>(),
            312usize,
            concat!("Size of: ", stringify!(PCM_source_peaktransfer_t))
        );
        assert_eq!(
            ::std::mem::align_of::<PCM_source_peaktransfer_t>(),
            8usize,
            concat!("Alignment of ", stringify!(PCM_source_peaktransfer_t))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).start_time as *const _
                    as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(start_time)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).peakrate as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(peakrate)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).numpeak_points as *const _
                    as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(numpeak_points)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).nchpeaks as *const _ as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(nchpeaks)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).peaks as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(peaks)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).peaks_out as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(peaks_out)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).output_mode as *const _
                    as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(output_mode)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).absolute_time_s as *const _
                    as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(absolute_time_s)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).peaks_minvals as *const _
                    as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(peaks_minvals)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).peaks_minvals_used as *const _
                    as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(peaks_minvals_used)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).samplerate as *const _
                    as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(samplerate)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<PCM_source_peaktransfer_t>())).exp as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_source_peaktransfer_t),
                "::",
                stringify!(exp)
            )
        );
    }
    #[repr(C)]
    pub struct PCM_source__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct PCM_source {
        pub vtable_: *const PCM_source__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_PCM_source() {
        assert_eq!(
            ::std::mem::size_of::<PCM_source>(),
            8usize,
            concat!("Size of: ", stringify!(PCM_source))
        );
        assert_eq!(
            ::std::mem::align_of::<PCM_source>(),
            8usize,
            concat!("Alignment of ", stringify!(PCM_source))
        );
    }
    #[repr(C)]
    pub struct ISimpleMediaDecoder__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct ISimpleMediaDecoder {
        pub vtable_: *const ISimpleMediaDecoder__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_ISimpleMediaDecoder() {
        assert_eq!(
            ::std::mem::size_of::<ISimpleMediaDecoder>(),
            8usize,
            concat!("Size of: ", stringify!(ISimpleMediaDecoder))
        );
        assert_eq!(
            ::std::mem::align_of::<ISimpleMediaDecoder>(),
            8usize,
            concat!("Alignment of ", stringify!(ISimpleMediaDecoder))
        );
    }
    #[repr(C)]
    pub struct PCM_sink__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, PartialEq)]
    pub struct PCM_sink {
        pub vtable_: *const PCM_sink__bindgen_vtable,
        pub m_st: f64,
    }
    #[test]
    fn bindgen_test_layout_PCM_sink() {
        assert_eq!(
            ::std::mem::size_of::<PCM_sink>(),
            16usize,
            concat!("Size of: ", stringify!(PCM_sink))
        );
        assert_eq!(
            ::std::mem::align_of::<PCM_sink>(),
            8usize,
            concat!("Alignment of ", stringify!(PCM_sink))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<PCM_sink>())).m_st as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(PCM_sink),
                "::",
                stringify!(m_st)
            )
        );
    }
    #[repr(C)]
    pub struct REAPER_Resample_Interface__bindgen_vtable(::std::os::raw::c_void);
    #[doc = " Resampler API (plug-ins can use this for SRC)"]
    #[doc = ""]
    #[doc = ""]
    #[doc = " See API functions Resampler_Create() and Resample_EnumModes()"]
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct REAPER_Resample_Interface {
        pub vtable_: *const REAPER_Resample_Interface__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_REAPER_Resample_Interface() {
        assert_eq!(
            ::std::mem::size_of::<REAPER_Resample_Interface>(),
            8usize,
            concat!("Size of: ", stringify!(REAPER_Resample_Interface))
        );
        assert_eq!(
            ::std::mem::align_of::<REAPER_Resample_Interface>(),
            8usize,
            concat!("Alignment of ", stringify!(REAPER_Resample_Interface))
        );
    }
    #[repr(C)]
    pub struct IReaperPitchShift__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct IReaperPitchShift {
        pub vtable_: *const IReaperPitchShift__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_IReaperPitchShift() {
        assert_eq!(
            ::std::mem::size_of::<IReaperPitchShift>(),
            8usize,
            concat!("Size of: ", stringify!(IReaperPitchShift))
        );
        assert_eq!(
            ::std::mem::align_of::<IReaperPitchShift>(),
            8usize,
            concat!("Alignment of ", stringify!(IReaperPitchShift))
        );
    }
    #[repr(C)]
    pub struct REAPER_PeakGet_Interface__bindgen_vtable(::std::os::raw::c_void);
    #[doc = " Peak getting/building API"]
    #[doc = ""]
    #[doc = " These are really only needed if you implement a PCM_source or PCM_sink."]
    #[doc = ""]
    #[doc = " See functions PeakGet_Create(), PeakBuild_Create(), GetPeakFileName(), ClearPeakCache()"]
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct REAPER_PeakGet_Interface {
        pub vtable_: *const REAPER_PeakGet_Interface__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_REAPER_PeakGet_Interface() {
        assert_eq!(
            ::std::mem::size_of::<REAPER_PeakGet_Interface>(),
            8usize,
            concat!("Size of: ", stringify!(REAPER_PeakGet_Interface))
        );
        assert_eq!(
            ::std::mem::align_of::<REAPER_PeakGet_Interface>(),
            8usize,
            concat!("Alignment of ", stringify!(REAPER_PeakGet_Interface))
        );
    }
    #[repr(C)]
    pub struct REAPER_PeakBuild_Interface__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct REAPER_PeakBuild_Interface {
        pub vtable_: *const REAPER_PeakBuild_Interface__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_REAPER_PeakBuild_Interface() {
        assert_eq!(
            ::std::mem::size_of::<REAPER_PeakBuild_Interface>(),
            8usize,
            concat!("Size of: ", stringify!(REAPER_PeakBuild_Interface))
        );
        assert_eq!(
            ::std::mem::align_of::<REAPER_PeakBuild_Interface>(),
            8usize,
            concat!("Alignment of ", stringify!(REAPER_PeakBuild_Interface))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct gaccel_register_t {
        pub accel: root::ACCEL,
        pub desc: *const ::std::os::raw::c_char,
    }
    #[test]
    fn bindgen_test_layout_gaccel_register_t() {
        assert_eq!(
            ::std::mem::size_of::<gaccel_register_t>(),
            16usize,
            concat!("Size of: ", stringify!(gaccel_register_t))
        );
        assert_eq!(
            ::std::mem::align_of::<gaccel_register_t>(),
            8usize,
            concat!("Alignment of ", stringify!(gaccel_register_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<gaccel_register_t>())).accel as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(gaccel_register_t),
                "::",
                stringify!(accel)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<gaccel_register_t>())).desc as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(gaccel_register_t),
                "::",
                stringify!(desc)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct audio_hook_register_t {
        pub OnAudioBuffer: ::std::option::Option<
            unsafe extern "C" fn(
                isPost: bool,
                len: ::std::os::raw::c_int,
                srate: f64,
                reg: *mut root::audio_hook_register_t,
            ),
        >,
        pub userdata1: *mut ::std::os::raw::c_void,
        pub userdata2: *mut ::std::os::raw::c_void,
        pub input_nch: ::std::os::raw::c_int,
        pub output_nch: ::std::os::raw::c_int,
        pub GetBuffer: ::std::option::Option<
            unsafe extern "C" fn(
                isOutput: bool,
                idx: ::std::os::raw::c_int,
            ) -> *mut root::ReaSample,
        >,
    }
    #[test]
    fn bindgen_test_layout_audio_hook_register_t() {
        assert_eq!(
            ::std::mem::size_of::<audio_hook_register_t>(),
            40usize,
            concat!("Size of: ", stringify!(audio_hook_register_t))
        );
        assert_eq!(
            ::std::mem::align_of::<audio_hook_register_t>(),
            8usize,
            concat!("Alignment of ", stringify!(audio_hook_register_t))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).OnAudioBuffer as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(OnAudioBuffer)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).userdata1 as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(userdata1)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).userdata2 as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(userdata2)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).input_nch as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(input_nch)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).output_nch as *const _ as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(output_nch)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<audio_hook_register_t>())).GetBuffer as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(audio_hook_register_t),
                "::",
                stringify!(GetBuffer)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct KbdCmd {
        pub cmd: root::DWORD,
        pub text: *const ::std::os::raw::c_char,
    }
    #[test]
    fn bindgen_test_layout_KbdCmd() {
        assert_eq!(
            ::std::mem::size_of::<KbdCmd>(),
            16usize,
            concat!("Size of: ", stringify!(KbdCmd))
        );
        assert_eq!(
            ::std::mem::align_of::<KbdCmd>(),
            8usize,
            concat!("Alignment of ", stringify!(KbdCmd))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdCmd>())).cmd as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdCmd),
                "::",
                stringify!(cmd)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdCmd>())).text as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdCmd),
                "::",
                stringify!(text)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct KbdKeyBindingInfo {
        pub key: ::std::os::raw::c_int,
        pub cmd: ::std::os::raw::c_int,
        pub flags: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_KbdKeyBindingInfo() {
        assert_eq!(
            ::std::mem::size_of::<KbdKeyBindingInfo>(),
            12usize,
            concat!("Size of: ", stringify!(KbdKeyBindingInfo))
        );
        assert_eq!(
            ::std::mem::align_of::<KbdKeyBindingInfo>(),
            4usize,
            concat!("Alignment of ", stringify!(KbdKeyBindingInfo))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdKeyBindingInfo>())).key as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdKeyBindingInfo),
                "::",
                stringify!(key)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdKeyBindingInfo>())).cmd as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdKeyBindingInfo),
                "::",
                stringify!(cmd)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdKeyBindingInfo>())).flags as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdKeyBindingInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
    pub struct KbdSectionInfo {
        pub uniqueID: ::std::os::raw::c_int,
        pub name: *const ::std::os::raw::c_char,
        pub action_list: *mut root::KbdCmd,
        pub action_list_cnt: ::std::os::raw::c_int,
        pub def_keys: *mut root::KbdKeyBindingInfo,
        pub def_keys_cnt: ::std::os::raw::c_int,
        pub onAction: ::std::option::Option<
            unsafe extern "C" fn(
                cmd: ::std::os::raw::c_int,
                val: ::std::os::raw::c_int,
                valhw: ::std::os::raw::c_int,
                relmode: ::std::os::raw::c_int,
                hwnd: root::HWND,
            ) -> bool,
        >,
        pub accels: *mut ::std::os::raw::c_void,
        pub recent_cmds: *mut ::std::os::raw::c_void,
        pub extended_data: [*mut ::std::os::raw::c_void; 32usize],
    }
    #[test]
    fn bindgen_test_layout_KbdSectionInfo() {
        assert_eq!(
            ::std::mem::size_of::<KbdSectionInfo>(),
            328usize,
            concat!("Size of: ", stringify!(KbdSectionInfo))
        );
        assert_eq!(
            ::std::mem::align_of::<KbdSectionInfo>(),
            8usize,
            concat!("Alignment of ", stringify!(KbdSectionInfo))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).uniqueID as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(uniqueID)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).name as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).action_list as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(action_list)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<KbdSectionInfo>())).action_list_cnt as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(action_list_cnt)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).def_keys as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(def_keys)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).def_keys_cnt as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(def_keys_cnt)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).onAction as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(onAction)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).accels as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(accels)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<KbdSectionInfo>())).recent_cmds as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(recent_cmds)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<KbdSectionInfo>())).extended_data as *const _ as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(KbdSectionInfo),
                "::",
                stringify!(extended_data)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialEq)]
    pub struct preview_register_t {
        pub cs: root::CRITICAL_SECTION,
        pub src: *mut root::PCM_source,
        pub m_out_chan: ::std::os::raw::c_int,
        pub curpos: f64,
        pub loop_: bool,
        pub volume: f64,
        pub peakvol: [f64; 2usize],
        pub preview_track: *mut ::std::os::raw::c_void,
    }
    #[test]
    fn bindgen_test_layout_preview_register_t() {
        assert_eq!(
            ::std::mem::size_of::<preview_register_t>(),
            104usize,
            concat!("Size of: ", stringify!(preview_register_t))
        );
        assert_eq!(
            ::std::mem::align_of::<preview_register_t>(),
            8usize,
            concat!("Alignment of ", stringify!(preview_register_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).cs as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(cs)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).src as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(src)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<preview_register_t>())).m_out_chan as *const _ as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(m_out_chan)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).curpos as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(curpos)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).loop_ as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(loop_)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).volume as *const _ as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(volume)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<preview_register_t>())).peakvol as *const _ as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(peakvol)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<preview_register_t>())).preview_track as *const _ as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(preview_register_t),
                "::",
                stringify!(preview_track)
            )
        );
    }
    pub type screensetNewCallbackFunc = ::std::option::Option<
        unsafe extern "C" fn(
            action: ::std::os::raw::c_int,
            id: *const ::std::os::raw::c_char,
            param: *mut ::std::os::raw::c_void,
            actionParm: *mut ::std::os::raw::c_void,
            actionParmSize: ::std::os::raw::c_int,
        ) -> root::LRESULT,
    >;
    #[repr(C)]
    pub struct midi_Output__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct midi_Output {
        pub vtable_: *const midi_Output__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_midi_Output() {
        assert_eq!(
            ::std::mem::size_of::<midi_Output>(),
            8usize,
            concat!("Size of: ", stringify!(midi_Output))
        );
        assert_eq!(
            ::std::mem::align_of::<midi_Output>(),
            8usize,
            concat!("Alignment of ", stringify!(midi_Output))
        );
    }
    #[repr(C)]
    pub struct midi_Input__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct midi_Input {
        pub vtable_: *const midi_Input__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_midi_Input() {
        assert_eq!(
            ::std::mem::size_of::<midi_Input>(),
            8usize,
            concat!("Size of: ", stringify!(midi_Input))
        );
        assert_eq!(
            ::std::mem::align_of::<midi_Input>(),
            8usize,
            concat!("Alignment of ", stringify!(midi_Input))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct ReaProject {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct MediaTrack {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct MediaItem {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct MediaItem_Take {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct TrackEnvelope {
        _unused: [u8; 0],
    }
    #[repr(C)]
    pub struct IReaperControlSurface__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialEq, Eq)]
    pub struct IReaperControlSurface {
        pub vtable_: *const IReaperControlSurface__bindgen_vtable,
    }
    #[test]
    fn bindgen_test_layout_IReaperControlSurface() {
        assert_eq!(
            ::std::mem::size_of::<IReaperControlSurface>(),
            8usize,
            concat!("Size of: ", stringify!(IReaperControlSurface))
        );
        assert_eq!(
            ::std::mem::align_of::<IReaperControlSurface>(),
            8usize,
            concat!("Alignment of ", stringify!(IReaperControlSurface))
        );
    }
    pub mod reaper_functions {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub type LICE_pixel = ::std::os::raw::c_uint;
        pub type LICE_pixel_chan = ::std::os::raw::c_uchar;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct LICE_IBitmap {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct LICE_IFont {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct WDL_VirtualWnd_BGCfg {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct AudioAccessor {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct joystick_device {
            _unused: [u8; 0],
        }
        extern "C" {
